<?xml version="1.0" ?>
<net name="facenet-20180408-102900" version="10">
	<layers>
		<layer id="0" name="image_batch/placeholder_port_0" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 160, 160"/>
			<output>
				<port id="0" names="image_batch" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_3490151079" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="image_batch/placeholder_port_0/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_34903" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="image_batch/placeholder_port_0/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="image_batch:0,input:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="32, 3, 3, 3" size="1728"/>
			<output>
				<port id="0" names="InceptionResnetV1/Conv2d_1a_3x3/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="InceptionResnetV1/Conv2d_1a_3x3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_3490634911" type="Const" version="opset1">
			<data element_type="f16" offset="1736" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="InceptionResnetV1/Conv2d_1a_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Conv2d_1a_3x3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1800" shape="32, 32, 3, 3" size="18432"/>
			<output>
				<port id="0" names="InceptionResnetV1/Conv2d_2a_3x3/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="InceptionResnetV1/Conv2d_2a_3x3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_3491434919" type="Const" version="opset1">
			<data element_type="f16" offset="20232" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="InceptionResnetV1/Conv2d_2a_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Conv2d_2a_3x3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="20296" shape="64, 32, 3, 3" size="36864"/>
			<output>
				<port id="0" names="InceptionResnetV1/Conv2d_2b_3x3/weights/read:0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="InceptionResnetV1/Conv2d_2b_3x3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_3492234927" type="Const" version="opset1">
			<data element_type="f16" offset="57160" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="InceptionResnetV1/Conv2d_2b_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Conv2d_2b_3x3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="InceptionResnetV1/MaxPool_3a_3x3/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3, 3" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/MaxPool_3a_3x3/MaxPool:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="57288" shape="80, 64, 1, 1" size="10240"/>
			<output>
				<port id="0" names="InceptionResnetV1/Conv2d_3b_1x1/weights/read:0" precision="FP16">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="InceptionResnetV1/Conv2d_3b_1x1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_3493034935" type="Const" version="opset1">
			<data element_type="f16" offset="67528" shape="1, 80, 1, 1" size="160"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="InceptionResnetV1/Conv2d_3b_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Conv2d_3b_1x1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="67688" shape="192, 80, 3, 3" size="276480"/>
			<output>
				<port id="0" names="InceptionResnetV1/Conv2d_4a_3x3/weights/read:0" precision="FP16">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="InceptionResnetV1/Conv2d_4a_3x3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_3493834943" type="Const" version="opset1">
			<data element_type="f16" offset="344168" shape="1, 192, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="InceptionResnetV1/Conv2d_4a_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Conv2d_4a_3x3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="344552" shape="256, 192, 3, 3" size="884736"/>
			<output>
				<port id="0" names="InceptionResnetV1/Conv2d_4b_3x3/weights/read:0" precision="FP16">
					<dim>256</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="InceptionResnetV1/Conv2d_4b_3x3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="data_add_3494634951" type="Const" version="opset1">
			<data element_type="f16" offset="1229288" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="InceptionResnetV1/Conv2d_4b_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Conv2d_4b_3x3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1229800" shape="32, 256, 1, 1" size="16384"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_3499434999" type="Const" version="opset1">
			<data element_type="f16" offset="1246184" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1246248" shape="32, 256, 1, 1" size="16384"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_3497834983" type="Const" version="opset1">
			<data element_type="f16" offset="1262632" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1262696" shape="32, 32, 3, 3" size="18432"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="data_add_3498634991" type="Const" version="opset1">
			<data element_type="f16" offset="1281128" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1281192" shape="32, 256, 1, 1" size="16384"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_3495434959" type="Const" version="opset1">
			<data element_type="f16" offset="1297576" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1297640" shape="32, 32, 3, 3" size="18432"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_3496234967" type="Const" version="opset1">
			<data element_type="f16" offset="1316072" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1316136" shape="32, 32, 3, 3" size="18432"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="data_add_3497034975" type="Const" version="opset1">
			<data element_type="f16" offset="1334568" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="InceptionResnetV1/Repeat/block35_1/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" names="InceptionResnetV1/Repeat/block35_1/concat:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="InceptionResnetV1/Repeat/block35_1/mul/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1334632" shape="256, 96, 1, 1" size="49152"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/weights/read:0" precision="FP16">
					<dim>256</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="data_add_3500235007" type="Const" version="opset1">
			<data element_type="f16" offset="1383784" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_1/mul:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="InceptionResnetV1/Repeat/block35_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_1/add:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="InceptionResnetV1/Repeat/block35_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1384296" shape="32, 256, 1, 1" size="16384"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_3505035055" type="Const" version="opset1">
			<data element_type="f16" offset="1400680" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1400744" shape="32, 256, 1, 1" size="16384"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="data_add_3503435039" type="Const" version="opset1">
			<data element_type="f16" offset="1417128" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1417192" shape="32, 32, 3, 3" size="18432"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="data_add_3504235047" type="Const" version="opset1">
			<data element_type="f16" offset="1435624" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm/cond_1/Switch_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1435688" shape="32, 256, 1, 1" size="16384"/>
			<output>
				<port id="0" names="InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="data_add_3501035015" type="Const" version="opset1">
			<data element_type="f16" offset="1452072" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
